export const addressMappings = {
    'שלונסקי 11': 'Shlonsky 11, Rishon Lezion',
    'ליבין יוסף וראיסה פינת העצמאות': 'ליבין יוסף',
    'מורי גלמן 23': 'מוריי גלמן 23',
    'רבי איזדור פינת גוסטב הרץ': 'גוסטב הרץ 27',
    'הנרי ברגנסון 19 פינת פסטרנק': 'הנרי ברגסון 4',
    'נלי ז\'קס מול 4': 'נלי זק"ס 4',
    'אבא הילל סילבר 4 ראשון לציון': 'אבא הלל סילבר 4 ראשון לציון',
    'אבא הילל סיבר 4': 'אבא הלל סילבר 4 ראשון לציון',
    'בן אסרף 31 ראשון לציון': 'בנאסרף 31',
    'בן אפריים 6 ראשון לציון': 'בן אפרים 6 ראשון לציון',
    'הארגמן 16 ראשון לציון': 'ארגמן 16, ראשון לציון',
    'חיל רגלים 1 ראשון לציון': 'חיל הרגלים 1 ראשון לציון',
    'יחזקאל הנביא בכיכר ליד ביהכנ"ס ראשון לציון': 'יחזקאל הנביא/נחמיה',
    'נחל שורק בחורשה ראשון לציון': 'רמז/הר ציון',
    'פול ברגסון 19 ראשון לציון': 'פול ברג 30 ראשון לציון',
    'ההתיישבות 55 ראשון לציון': 'התישבות 55, ראשון לציון',
    'השומרה פינת הסוכה ראשון לציון': 'שומרה ראשון לציון',
    'שלמה עיראקי 16 ראשון לציון': 'שלמה עראקי 16 ראשון לציון',
    'יעקב בן סירה מול 9': 'סירה 9 ראשון לציון',
    'אולגה ויהושוע פינת מיכאל לוין': 'אולגה ויהשוע',
    'הדיגיים פינת הנחשול ראשון לציון': 'הדייגים/הנחשול ראשון לציון',
    'יוסף רוייז פינת ארבל  ראשון לציון': 'יוסף רויז 34 ראשון לציון', //'Yosef Raviz 34 ראשון לציון', 
    'רבי משה בן מימון 1': 'רמב"ם 1 ראשון לציון'
};

export function getAddressMapping(address) {
    return addressMappings[address] || address;
}